GopalSaraf/Practicals/PSDL/include/proc/pic18f25k80.inc
// Register: B3D0
#define B3D0 B3D0
B3D0                                     equ 0EB6h
// bitfield definitions
B3D0_B3D0_POSN                           equ 0000h
B3D0_B3D0_POSITION                       equ 0000h
B3D0_B3D0_SIZE                           equ 0008h
B3D0_B3D0_LENGTH                         equ 0008h
B3D0_B3D0_MASK                           equ 00FFh
B3D0_B3D00_POSN                          equ 0000h
B3D0_B3D00_POSITION                      equ 0000h
B3D0_B3D00_SIZE                          equ 0001h
B3D0_B3D00_LENGTH                        equ 0001h
B3D0_B3D00_MASK                          equ 0001h
B3D0_B3D01_POSN                          equ 0001h
B3D0_B3D01_POSITION                      equ 0001h
B3D0_B3D01_SIZE                          equ 0001h
B3D0_B3D01_LENGTH                        equ 0001h
B3D0_B3D01_MASK                          equ 0002h
B3D0_B3D02_POSN                          equ 0002h
B3D0_B3D02_POSITION                      equ 0002h
B3D0_B3D02_SIZE                          equ 0001h
B3D0_B3D02_LENGTH                        equ 0001h
B3D0_B3D02_MASK                          equ 0004h
B3D0_B3D03_POSN                          equ 0003h
B3D0_B3D03_POSITION                      equ 0003h
B3D0_B3D03_SIZE                          equ 0001h
B3D0_B3D03_LENGTH                        equ 0001h
B3D0_B3D03_MASK                          equ 0008h
B3D0_B3D04_POSN                          equ 0004h
B3D0_B3D04_POSITION                      equ 0004h
B3D0_B3D04_SIZE                          equ 0001h
B3D0_B3D04_LENGTH                        equ 0001h
B3D0_B3D04_MASK                          equ 0010h
B3D0_B3D05_POSN                          equ 0005h
B3D0_B3D05_POSITION                      equ 0005h
B3D0_B3D05_SIZE                          equ 0001h
B3D0_B3D05_LENGTH                        equ 0001h
B3D0_B3D05_MASK                          equ 0020h
B3D0_B3D06_POSN                          equ 0006h
B3D0_B3D06_POSITION                      equ 0006h
B3D0_B3D06_SIZE                          equ 0001h
B3D0_B3D06_LENGTH                        equ 0001h
B3D0_B3D06_MASK                          equ 0040h
B3D0_B3D07_POSN                          equ 0007h
B3D0_B3D07_POSITION                      equ 0007h
B3D0_B3D07_SIZE                          equ 0001h
B3D0_B3D07_LENGTH                        equ 0001h
B3D0_B3D07_MASK                          equ 0080h

// Register: B3D1
#define B3D1 B3D1
B3D1                                     equ 0EB7h
// bitfield definitions
B3D1_B3D1_POSN                           equ 0000h
B3D1_B3D1_POSITION                       equ 0000h
B3D1_B3D1_SIZE                           equ 0008h
B3D1_B3D1_LENGTH                         equ 0008h
B3D1_B3D1_MASK                           equ 00FFh
B3D1_B3D10_POSN                          equ 0000h
B3D1_B3D10_POSITION                      equ 0000h
B3D1_B3D10_SIZE                          equ 0001h
B3D1_B3D10_LENGTH                        equ 0001h
B3D1_B3D10_MASK                          equ 0001h
B3D1_B3D11_POSN                          equ 0001h
B3D1_B3D11_POSITION                      equ 0001h
B3D1_B3D11_SIZE                          equ 0001h
B3D1_B3D11_LENGTH                        equ 0001h
B3D1_B3D11_MASK                          equ 0002h
B3D1_B3D12_POSN                          equ 0002h
B3D1_B3D12_POSITION                      equ 0002h
B3D1_B3D12_SIZE                          equ 0001h
B3D1_B3D12_LENGTH                        equ 0001h
B3D1_B3D12_MASK                          equ 0004h
B3D1_B3D13_POSN                          equ 0003h
B3D1_B3D13_POSITION                      equ 0003h
B3D1_B3D13_SIZE                          equ 0001h
B3D1_B3D13_LENGTH                        equ 0001h
B3D1_B3D13_MASK                          equ 0008h
B3D1_B3D14_POSN                          equ 0004h
B3D1_B3D14_POSITION                      equ 0004h
B3D1_B3D14_SIZE                          equ 0001h
B3D1_B3D14_LENGTH                        equ 0001h
B3D1_B3D14_MASK                          equ 0010h
B3D1_B3D15_POSN                          equ 0005h
B3D1_B3D15_POSITION                      equ 0005h
B3D1_B3D15_SIZE                          equ 0001h
B3D1_B3D15_LENGTH                        equ 0001h
B3D1_B3D15_MASK                          equ 0020h
B3D1_B3D16_POSN                          equ 0006h
B3D1_B3D16_POSITION                      equ 0006h
B3D1_B3D16_SIZE                          equ 0001h
B3D1_B3D16_LENGTH                        equ 0001h
B3D1_B3D16_MASK                          equ 0040h
B3D1_B3D17_POSN                          equ 0007h
B3D1_B3D17_POSITION                      equ 0007h
B3D1_B3D17_SIZE                          equ 0001h
B3D1_B3D17_LENGTH                        equ 0001h
B3D1_B3D17_MASK                          equ 0080h

// Register: B3D2
#define B3D2 B3D2
B3D2                                     equ 0EB8h
// bitfield definitions
B3D2_B3D2_POSN                           equ 0000h
B3D2_B3D2_POSITION                       equ 0000h
B3D2_B3D2_SIZE                           equ 0008h
B3D2_B3D2_LENGTH                         equ 0008h
B3D2_B3D2_MASK                           equ 00FFh
B3D2_B3D20_POSN                          equ 0000h
B3D2_B3D20_POSITION                      equ 0000h
B3D2_B3D20_SIZE                          equ 0001h
B3D2_B3D20_LENGTH                        equ 0001h
B3D2_B3D20_MASK                          equ 0001h
B3D2_B3D21_POSN                          equ 0001h
B3D2_B3D21_POSITION                      equ 0001h
B3D2_B3D21_SIZE                          equ 0001h
B3D2_B3D21_LENGTH                        equ 0001h
B3D2_B3D21_MASK                          equ 0002h
B3D2_B3D22_POSN                          equ 0002h
B3D2_B3D22_POSITION                      equ 0002h
B3D2_B3D22_SIZE                          equ 0001h
B3D2_B3D22_LENGTH                        equ 0001h
B3D2_B3D22_MASK                          equ 0004h
B3D2_B3D23_POSN                          equ 0003h
B3D2_B3D23_POSITION                      equ 0003h
B3D2_B3D23_SIZE                          equ 0001h
B3D2_B3D23_LENGTH                        equ 0001h
B3D2_B3D23_MASK                          equ 0008h
B3D2_B3D24_POSN                          equ 0004h
B3D2_B3D24_POSITION                      equ 0004h
B3D2_B3D24_SIZE                          equ 0001h
B3D2_B3D24_LENGTH                        equ 0001h
B3D2_B3D24_MASK                          equ 0010h
B3D2_B3D25_POSN                          equ 0005h
B3D2_B3D25_POSITION                      equ 0005h
B3D2_B3D25_SIZE                          equ 0001h
B3D2_B3D25_LENGTH                        equ 0001h
B3D2_B3D25_MASK                          equ 0020h
B3D2_B3D26_POSN                          equ 0006h
B3D2_B3D26_POSITION                      equ 0006h
B3D2_B3D26_SIZE                          equ 0001h
B3D2_B3D26_LENGTH                        equ 0001h
B3D2_B3D26_MASK                          equ 0040h
B3D2_B3D27_POSN                          equ 0007h
B3D2_B3D27_POSITION                      equ 0007h
B3D2_B3D27_SIZE                          equ 0001h
B3D2_B3D27_LENGTH                        equ 0001h
B3D2_B3D27_MASK                          equ 0080h

