GopalSaraf/Practicals/PSDL/include/proc/pic18f25k80.inc
// Register: PADCFG1
#define PADCFG1 PADCFG1
PADCFG1                                  equ 0F56h
// bitfield definitions
PADCFG1_CTMUDS_POSN                      equ 0000h
PADCFG1_CTMUDS_POSITION                  equ 0000h
PADCFG1_CTMUDS_SIZE                      equ 0001h
PADCFG1_CTMUDS_LENGTH                    equ 0001h
PADCFG1_CTMUDS_MASK                      equ 0001h
PADCFG1_PMPTTL_POSN                      equ 0000h
PADCFG1_PMPTTL_POSITION                  equ 0000h
PADCFG1_PMPTTL_SIZE                      equ 0001h
PADCFG1_PMPTTL_LENGTH                    equ 0001h
PADCFG1_PMPTTL_MASK                      equ 0001h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0F57h
// bitfield definitions
PMD2_CMP1MD_POSN                         equ 0000h
PMD2_CMP1MD_POSITION                     equ 0000h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0001h
PMD2_CMP2MD_POSN                         equ 0001h
PMD2_CMP2MD_POSITION                     equ 0001h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0002h
PMD2_ECANMD_POSN                         equ 0002h
PMD2_ECANMD_POSITION                     equ 0002h
PMD2_ECANMD_SIZE                         equ 0001h
PMD2_ECANMD_LENGTH                       equ 0001h
PMD2_ECANMD_MASK                         equ 0004h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0F58h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_ADCMD_POSN                          equ 0005h
PMD1_ADCMD_POSITION                      equ 0005h
PMD1_ADCMD_SIZE                          equ 0001h
PMD1_ADCMD_LENGTH                        equ 0001h
PMD1_ADCMD_MASK                          equ 0020h
PMD1_CTMUMD_POSN                         equ 0006h
PMD1_CTMUMD_POSITION                     equ 0006h
PMD1_CTMUMD_SIZE                         equ 0001h
PMD1_CTMUMD_LENGTH                       equ 0001h
PMD1_CTMUMD_MASK                         equ 0040h
PMD1_PSPMD_POSN                          equ 0007h
PMD1_PSPMD_POSITION                      equ 0007h
PMD1_PSPMD_SIZE                          equ 0001h
PMD1_PSPMD_LENGTH                        equ 0001h
PMD1_PSPMD_MASK                          equ 0080h
PMD1_EMBMD_POSN                          equ 0000h
PMD1_EMBMD_POSITION                      equ 0000h
PMD1_EMBMD_SIZE                          equ 0001h
PMD1_EMBMD_LENGTH                        equ 0001h
PMD1_EMBMD_MASK                          equ 0001h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0F59h
// bitfield definitions
PMD0_SSPMD_POSN                          equ 0000h
PMD0_SSPMD_POSITION                      equ 0000h
PMD0_SSPMD_SIZE                          equ 0001h
PMD0_SSPMD_LENGTH                        equ 0001h
PMD0_SSPMD_MASK                          equ 0001h
PMD0_UART1MD_POSN                        equ 0001h
PMD0_UART1MD_POSITION                    equ 0001h
PMD0_UART1MD_SIZE                        equ 0001h
PMD0_UART1MD_LENGTH                      equ 0001h
PMD0_UART1MD_MASK                        equ 0002h
PMD0_UART2MD_POSN                        equ 0002h
PMD0_UART2MD_POSITION                    equ 0002h
PMD0_UART2MD_SIZE                        equ 0001h
PMD0_UART2MD_LENGTH                      equ 0001h
PMD0_UART2MD_MASK                        equ 0004h
PMD0_CCP1MD_POSN                         equ 0003h
PMD0_CCP1MD_POSITION                     equ 0003h
PMD0_CCP1MD_SIZE                         equ 0001h
PMD0_CCP1MD_LENGTH                       equ 0001h
PMD0_CCP1MD_MASK                         equ 0008h
PMD0_CCP2MD_POSN                         equ 0004h
PMD0_CCP2MD_POSITION                     equ 0004h
PMD0_CCP2MD_SIZE                         equ 0001h
PMD0_CCP2MD_LENGTH                       equ 0001h
PMD0_CCP2MD_MASK                         equ 0010h
PMD0_CCP3MD_POSN                         equ 0005h
PMD0_CCP3MD_POSITION                     equ 0005h
PMD0_CCP3MD_SIZE                         equ 0001h
PMD0_CCP3MD_LENGTH                       equ 0001h
PMD0_CCP3MD_MASK                         equ 0020h
PMD0_CCP4MD_POSN                         equ 0006h
PMD0_CCP4MD_POSITION                     equ 0006h
PMD0_CCP4MD_SIZE                         equ 0001h
PMD0_CCP4MD_LENGTH                       equ 0001h
PMD0_CCP4MD_MASK                         equ 0040h
PMD0_CCP5MD_POSN                         equ 0007h
PMD0_CCP5MD_POSITION                     equ 0007h
PMD0_CCP5MD_SIZE                         equ 0001h
PMD0_CCP5MD_LENGTH                       equ 0001h
PMD0_CCP5MD_MASK                         equ 0080h
PMD0_SPI1MD_POSN                         equ 0001h
PMD0_SPI1MD_POSITION                     equ 0001h
PMD0_SPI1MD_SIZE                         equ 0001h
PMD0_SPI1MD_LENGTH                       equ 0001h
PMD0_SPI1MD_MASK                         equ 0002h
PMD0_SPI2MD_POSN                         equ 0002h
PMD0_SPI2MD_POSITION                     equ 0002h
PMD0_SPI2MD_SIZE                         equ 0001h
PMD0_SPI2MD_LENGTH                       equ 0001h
PMD0_SPI2MD_MASK                         equ 0004h

