GopalSaraf/Practicals/PSDL/include/proc/pic18f25k80.inc
// Register: CM2CON
#define CM2CON CM2CON
CM2CON                                   equ 0F5Eh
// bitfield definitions
CM2CON_CCH_POSN                          equ 0000h
CM2CON_CCH_POSITION                      equ 0000h
CM2CON_CCH_SIZE                          equ 0002h
CM2CON_CCH_LENGTH                        equ 0002h
CM2CON_CCH_MASK                          equ 0003h
CM2CON_CREF_POSN                         equ 0002h
CM2CON_CREF_POSITION                     equ 0002h
CM2CON_CREF_SIZE                         equ 0001h
CM2CON_CREF_LENGTH                       equ 0001h
CM2CON_CREF_MASK                         equ 0004h
CM2CON_EVPOL_POSN                        equ 0003h
CM2CON_EVPOL_POSITION                    equ 0003h
CM2CON_EVPOL_SIZE                        equ 0002h
CM2CON_EVPOL_LENGTH                      equ 0002h
CM2CON_EVPOL_MASK                        equ 0018h
CM2CON_CPOL_POSN                         equ 0005h
CM2CON_CPOL_POSITION                     equ 0005h
CM2CON_CPOL_SIZE                         equ 0001h
CM2CON_CPOL_LENGTH                       equ 0001h
CM2CON_CPOL_MASK                         equ 0020h
CM2CON_COE_POSN                          equ 0006h
CM2CON_COE_POSITION                      equ 0006h
CM2CON_COE_SIZE                          equ 0001h
CM2CON_COE_LENGTH                        equ 0001h
CM2CON_COE_MASK                          equ 0040h
CM2CON_CON_POSN                          equ 0007h
CM2CON_CON_POSITION                      equ 0007h
CM2CON_CON_SIZE                          equ 0001h
CM2CON_CON_LENGTH                        equ 0001h
CM2CON_CON_MASK                          equ 0080h
CM2CON_CCH0_POSN                         equ 0000h
CM2CON_CCH0_POSITION                     equ 0000h
CM2CON_CCH0_SIZE                         equ 0001h
CM2CON_CCH0_LENGTH                       equ 0001h
CM2CON_CCH0_MASK                         equ 0001h
CM2CON_CCH1_POSN                         equ 0001h
CM2CON_CCH1_POSITION                     equ 0001h
CM2CON_CCH1_SIZE                         equ 0001h
CM2CON_CCH1_LENGTH                       equ 0001h
CM2CON_CCH1_MASK                         equ 0002h
CM2CON_EVPOL0_POSN                       equ 0003h
CM2CON_EVPOL0_POSITION                   equ 0003h
CM2CON_EVPOL0_SIZE                       equ 0001h
CM2CON_EVPOL0_LENGTH                     equ 0001h
CM2CON_EVPOL0_MASK                       equ 0008h
CM2CON_EVPOL1_POSN                       equ 0004h
CM2CON_EVPOL1_POSITION                   equ 0004h
CM2CON_EVPOL1_SIZE                       equ 0001h
CM2CON_EVPOL1_LENGTH                     equ 0001h
CM2CON_EVPOL1_MASK                       equ 0010h
CM2CON_CCH02_POSN                        equ 0000h
CM2CON_CCH02_POSITION                    equ 0000h
CM2CON_CCH02_SIZE                        equ 0001h
CM2CON_CCH02_LENGTH                      equ 0001h
CM2CON_CCH02_MASK                        equ 0001h
CM2CON_CCH12_POSN                        equ 0001h
CM2CON_CCH12_POSITION                    equ 0001h
CM2CON_CCH12_SIZE                        equ 0001h
CM2CON_CCH12_LENGTH                      equ 0001h
CM2CON_CCH12_MASK                        equ 0002h
CM2CON_CREF2_POSN                        equ 0002h
CM2CON_CREF2_POSITION                    equ 0002h
CM2CON_CREF2_SIZE                        equ 0001h
CM2CON_CREF2_LENGTH                      equ 0001h
CM2CON_CREF2_MASK                        equ 0004h
CM2CON_EVPOL02_POSN                      equ 0003h
CM2CON_EVPOL02_POSITION                  equ 0003h
CM2CON_EVPOL02_SIZE                      equ 0001h
CM2CON_EVPOL02_LENGTH                    equ 0001h
CM2CON_EVPOL02_MASK                      equ 0008h
CM2CON_EVPOL12_POSN                      equ 0004h
CM2CON_EVPOL12_POSITION                  equ 0004h
CM2CON_EVPOL12_SIZE                      equ 0001h
CM2CON_EVPOL12_LENGTH                    equ 0001h
CM2CON_EVPOL12_MASK                      equ 0010h
CM2CON_CPOL2_POSN                        equ 0005h
CM2CON_CPOL2_POSITION                    equ 0005h
CM2CON_CPOL2_SIZE                        equ 0001h
CM2CON_CPOL2_LENGTH                      equ 0001h
CM2CON_CPOL2_MASK                        equ 0020h
CM2CON_COE2_POSN                         equ 0006h
CM2CON_COE2_POSITION                     equ 0006h
CM2CON_COE2_SIZE                         equ 0001h
CM2CON_COE2_LENGTH                       equ 0001h
CM2CON_COE2_MASK                         equ 0040h
CM2CON_CON2_POSN                         equ 0007h
CM2CON_CON2_POSITION                     equ 0007h
CM2CON_CON2_SIZE                         equ 0001h
CM2CON_CON2_LENGTH                       equ 0001h
CM2CON_CON2_MASK                         equ 0080h

// Register: CM1CON
#define CM1CON CM1CON
CM1CON                                   equ 0F5Fh
// bitfield definitions
CM1CON_CCH_POSN                          equ 0000h
CM1CON_CCH_POSITION                      equ 0000h
CM1CON_CCH_SIZE                          equ 0002h
CM1CON_CCH_LENGTH                        equ 0002h
CM1CON_CCH_MASK                          equ 0003h
CM1CON_CREF_POSN                         equ 0002h
CM1CON_CREF_POSITION                     equ 0002h
CM1CON_CREF_SIZE                         equ 0001h
CM1CON_CREF_LENGTH                       equ 0001h
CM1CON_CREF_MASK                         equ 0004h
CM1CON_EVPOL_POSN                        equ 0003h
CM1CON_EVPOL_POSITION                    equ 0003h
CM1CON_EVPOL_SIZE                        equ 0002h
CM1CON_EVPOL_LENGTH                      equ 0002h
CM1CON_EVPOL_MASK                        equ 0018h
CM1CON_CPOL_POSN                         equ 0005h
CM1CON_CPOL_POSITION                     equ 0005h
CM1CON_CPOL_SIZE                         equ 0001h
CM1CON_CPOL_LENGTH                       equ 0001h
CM1CON_CPOL_MASK                         equ 0020h
CM1CON_COE_POSN                          equ 0006h
CM1CON_COE_POSITION                      equ 0006h
CM1CON_COE_SIZE                          equ 0001h
CM1CON_COE_LENGTH                        equ 0001h
CM1CON_COE_MASK                          equ 0040h
CM1CON_CON_POSN                          equ 0007h
CM1CON_CON_POSITION                      equ 0007h
CM1CON_CON_SIZE                          equ 0001h
CM1CON_CON_LENGTH                        equ 0001h
CM1CON_CON_MASK                          equ 0080h
CM1CON_CCH0_POSN                         equ 0000h
CM1CON_CCH0_POSITION                     equ 0000h
CM1CON_CCH0_SIZE                         equ 0001h
CM1CON_CCH0_LENGTH                       equ 0001h
CM1CON_CCH0_MASK                         equ 0001h
CM1CON_CCH1_POSN                         equ 0001h
CM1CON_CCH1_POSITION                     equ 0001h
CM1CON_CCH1_SIZE                         equ 0001h
CM1CON_CCH1_LENGTH                       equ 0001h
CM1CON_CCH1_MASK                         equ 0002h
CM1CON_EVPOL0_POSN                       equ 0003h
CM1CON_EVPOL0_POSITION                   equ 0003h
CM1CON_EVPOL0_SIZE                       equ 0001h
CM1CON_EVPOL0_LENGTH                     equ 0001h
CM1CON_EVPOL0_MASK                       equ 0008h
CM1CON_EVPOL1_POSN                       equ 0004h
CM1CON_EVPOL1_POSITION                   equ 0004h
CM1CON_EVPOL1_SIZE                       equ 0001h
CM1CON_EVPOL1_LENGTH                     equ 0001h
CM1CON_EVPOL1_MASK                       equ 0010h
CM1CON_C1CH0_POSN                        equ 0000h
CM1CON_C1CH0_POSITION                    equ 0000h
CM1CON_C1CH0_SIZE                        equ 0001h
CM1CON_C1CH0_LENGTH                      equ 0001h
CM1CON_C1CH0_MASK                        equ 0001h
CM1CON_C1CH1_POSN                        equ 0001h
CM1CON_C1CH1_POSITION                    equ 0001h
CM1CON_C1CH1_SIZE                        equ 0001h
CM1CON_C1CH1_LENGTH                      equ 0001h
CM1CON_C1CH1_MASK                        equ 0002h
CM1CON_CREF1_POSN                        equ 0002h
CM1CON_CREF1_POSITION                    equ 0002h
CM1CON_CREF1_SIZE                        equ 0001h
CM1CON_CREF1_LENGTH                      equ 0001h
CM1CON_CREF1_MASK                        equ 0004h
CM1CON_EVPOL01_POSN                      equ 0003h
CM1CON_EVPOL01_POSITION                  equ 0003h
CM1CON_EVPOL01_SIZE                      equ 0001h
CM1CON_EVPOL01_LENGTH                    equ 0001h
CM1CON_EVPOL01_MASK                      equ 0008h
CM1CON_EVPOL11_POSN                      equ 0004h
CM1CON_EVPOL11_POSITION                  equ 0004h
CM1CON_EVPOL11_SIZE                      equ 0001h
CM1CON_EVPOL11_LENGTH                    equ 0001h
CM1CON_EVPOL11_MASK                      equ 0010h
CM1CON_CPOL1_POSN                        equ 0005h
CM1CON_CPOL1_POSITION                    equ 0005h
CM1CON_CPOL1_SIZE                        equ 0001h
CM1CON_CPOL1_LENGTH                      equ 0001h
CM1CON_CPOL1_MASK                        equ 0020h
CM1CON_COE1_POSN                         equ 0006h
CM1CON_COE1_POSITION                     equ 0006h
CM1CON_COE1_SIZE                         equ 0001h
CM1CON_COE1_LENGTH                       equ 0001h
CM1CON_COE1_MASK                         equ 0040h
CM1CON_CON1_POSN                         equ 0007h
CM1CON_CON1_POSITION                     equ 0007h
CM1CON_CON1_SIZE                         equ 0001h
CM1CON_CON1_LENGTH                       equ 0001h
CM1CON_CON1_MASK                         equ 0080h
CM1CON_CCH01_POSN                        equ 0000h
CM1CON_CCH01_POSITION                    equ 0000h
CM1CON_CCH01_SIZE                        equ 0001h
CM1CON_CCH01_LENGTH                      equ 0001h
CM1CON_CCH01_MASK                        equ 0001h
CM1CON_CCH11_POSN                        equ 0001h
CM1CON_CCH11_POSITION                    equ 0001h
CM1CON_CCH11_SIZE                        equ 0001h
CM1CON_CCH11_LENGTH                      equ 0001h
CM1CON_CCH11_MASK                        equ 0002h

// Register: RXB0CON
#define RXB0CON RXB0CON
RXB0CON                                  equ 0F60h
// bitfield definitions
RXB0CON_FILHIT0_POSN                     equ 0000h
RXB0CON_FILHIT0_POSITION                 equ 0000h
RXB0CON_FILHIT0_SIZE                     equ 0001h
RXB0CON_FILHIT0_LENGTH                   equ 0001h
RXB0CON_FILHIT0_MASK                     equ 0001h
RXB0CON_JTOFF_FILHIT1_POSN               equ 0001h
RXB0CON_JTOFF_FILHIT1_POSITION           equ 0001h
RXB0CON_JTOFF_FILHIT1_SIZE               equ 0001h
RXB0CON_JTOFF_FILHIT1_LENGTH             equ 0001h
RXB0CON_JTOFF_FILHIT1_MASK               equ 0002h
RXB0CON_RB0DBEN_FILHIT2_POSN             equ 0002h
RXB0CON_RB0DBEN_FILHIT2_POSITION         equ 0002h
RXB0CON_RB0DBEN_FILHIT2_SIZE             equ 0001h
RXB0CON_RB0DBEN_FILHIT2_LENGTH           equ 0001h
RXB0CON_RB0DBEN_FILHIT2_MASK             equ 0004h
RXB0CON_RXRTRRO_FILHIT3_POSN             equ 0003h
RXB0CON_RXRTRRO_FILHIT3_POSITION         equ 0003h
RXB0CON_RXRTRRO_FILHIT3_SIZE             equ 0001h
RXB0CON_RXRTRRO_FILHIT3_LENGTH           equ 0001h
RXB0CON_RXRTRRO_FILHIT3_MASK             equ 0008h
RXB0CON_FILHIT4_POSN                     equ 0004h
RXB0CON_FILHIT4_POSITION                 equ 0004h
RXB0CON_FILHIT4_SIZE                     equ 0001h
RXB0CON_FILHIT4_LENGTH                   equ 0001h
RXB0CON_FILHIT4_MASK                     equ 0010h
RXB0CON_RXM0_RTRRO_POSN                  equ 0005h
RXB0CON_RXM0_RTRRO_POSITION              equ 0005h
RXB0CON_RXM0_RTRRO_SIZE                  equ 0001h
RXB0CON_RXM0_RTRRO_LENGTH                equ 0001h
RXB0CON_RXM0_RTRRO_MASK                  equ 0020h
RXB0CON_RXM1_POSN                        equ 0006h
RXB0CON_RXM1_POSITION                    equ 0006h
RXB0CON_RXM1_SIZE                        equ 0001h
RXB0CON_RXM1_LENGTH                      equ 0001h
RXB0CON_RXM1_MASK                        equ 0040h
RXB0CON_RXFUL_POSN                       equ 0007h
RXB0CON_RXFUL_POSITION                   equ 0007h
RXB0CON_RXFUL_SIZE                       equ 0001h
RXB0CON_RXFUL_LENGTH                     equ 0001h
RXB0CON_RXFUL_MASK                       equ 0080h
RXB0CON_JTOFF_POSN                       equ 0001h
RXB0CON_JTOFF_POSITION                   equ 0001h
RXB0CON_JTOFF_SIZE                       equ 0001h
RXB0CON_JTOFF_LENGTH                     equ 0001h
RXB0CON_JTOFF_MASK                       equ 0002h
RXB0CON_RB0DBEN_POSN                     equ 0002h
RXB0CON_RB0DBEN_POSITION                 equ 0002h
RXB0CON_RB0DBEN_SIZE                     equ 0001h
RXB0CON_RB0DBEN_LENGTH                   equ 0001h
RXB0CON_RB0DBEN_MASK                     equ 0004h
RXB0CON_RXRTRRO_POSN                     equ 0003h
RXB0CON_RXRTRRO_POSITION                 equ 0003h
RXB0CON_RXRTRRO_SIZE                     equ 0001h
RXB0CON_RXRTRRO_LENGTH                   equ 0001h
RXB0CON_RXRTRRO_MASK                     equ 0008h
RXB0CON_RTRRO_POSN                       equ 0005h
RXB0CON_RTRRO_POSITION                   equ 0005h
RXB0CON_RTRRO_SIZE                       equ 0001h
RXB0CON_RTRRO_LENGTH                     equ 0001h
RXB0CON_RTRRO_MASK                       equ 0020h
RXB0CON_FILHIT1_POSN                     equ 0001h
RXB0CON_FILHIT1_POSITION                 equ 0001h
RXB0CON_FILHIT1_SIZE                     equ 0001h
RXB0CON_FILHIT1_LENGTH                   equ 0001h
RXB0CON_FILHIT1_MASK                     equ 0002h
RXB0CON_FILHIT2_POSN                     equ 0002h
RXB0CON_FILHIT2_POSITION                 equ 0002h
RXB0CON_FILHIT2_SIZE                     equ 0001h
RXB0CON_FILHIT2_LENGTH                   equ 0001h
RXB0CON_FILHIT2_MASK                     equ 0004h
RXB0CON_FILHIT3_POSN                     equ 0003h
RXB0CON_FILHIT3_POSITION                 equ 0003h
RXB0CON_FILHIT3_SIZE                     equ 0001h
RXB0CON_FILHIT3_LENGTH                   equ 0001h
RXB0CON_FILHIT3_MASK                     equ 0008h
RXB0CON_RXM0_POSN                        equ 0005h
RXB0CON_RXM0_POSITION                    equ 0005h
RXB0CON_RXM0_SIZE                        equ 0001h
RXB0CON_RXM0_LENGTH                      equ 0001h
RXB0CON_RXM0_MASK                        equ 0020h
RXB0CON_RXB0FILHIT0_POSN                 equ 0000h
RXB0CON_RXB0FILHIT0_POSITION             equ 0000h
RXB0CON_RXB0FILHIT0_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT0_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT0_MASK                 equ 0001h
RXB0CON_RXB0FILHIT1_POSN                 equ 0001h
RXB0CON_RXB0FILHIT1_POSITION             equ 0001h
RXB0CON_RXB0FILHIT1_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT1_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT1_MASK                 equ 0002h
RXB0CON_RXB0FILHIT2_POSN                 equ 0002h
RXB0CON_RXB0FILHIT2_POSITION             equ 0002h
RXB0CON_RXB0FILHIT2_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT2_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT2_MASK                 equ 0004h
RXB0CON_RXB0FILHIT3_POSN                 equ 0003h
RXB0CON_RXB0FILHIT3_POSITION             equ 0003h
RXB0CON_RXB0FILHIT3_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT3_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT3_MASK                 equ 0008h
RXB0CON_RXB0FILHIT4_POSN                 equ 0004h
RXB0CON_RXB0FILHIT4_POSITION             equ 0004h
RXB0CON_RXB0FILHIT4_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT4_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT4_MASK                 equ 0010h
RXB0CON_RXB0M0_POSN                      equ 0005h
RXB0CON_RXB0M0_POSITION                  equ 0005h
RXB0CON_RXB0M0_SIZE                      equ 0001h
RXB0CON_RXB0M0_LENGTH                    equ 0001h
RXB0CON_RXB0M0_MASK                      equ 0020h
RXB0CON_RXB0M1_POSN                      equ 0006h
RXB0CON_RXB0M1_POSITION                  equ 0006h
RXB0CON_RXB0M1_SIZE                      equ 0001h
RXB0CON_RXB0M1_LENGTH                    equ 0001h
RXB0CON_RXB0M1_MASK                      equ 0040h
RXB0CON_RXB0FUL_POSN                     equ 0007h
RXB0CON_RXB0FUL_POSITION                 equ 0007h
RXB0CON_RXB0FUL_SIZE                     equ 0001h
RXB0CON_RXB0FUL_LENGTH                   equ 0001h
RXB0CON_RXB0FUL_MASK                     equ 0080h
RXB0CON_RXB0RTRR0_POSN                   equ 0003h
RXB0CON_RXB0RTRR0_POSITION               equ 0003h
RXB0CON_RXB0RTRR0_SIZE                   equ 0001h
RXB0CON_RXB0RTRR0_LENGTH                 equ 0001h
RXB0CON_RXB0RTRR0_MASK                   equ 0008h
RXB0CON_RXB0RTRRO_POSN                   equ 0005h
RXB0CON_RXB0RTRRO_POSITION               equ 0005h
RXB0CON_RXB0RTRRO_SIZE                   equ 0001h
RXB0CON_RXB0RTRRO_LENGTH                 equ 0001h
RXB0CON_RXB0RTRRO_MASK                   equ 0020h

// Register: RXB0SIDH
#define RXB0SIDH RXB0SIDH
RXB0SIDH                                 equ 0F61h
// bitfield definitions
RXB0SIDH_SID_POSN                        equ 0000h
RXB0SIDH_SID_POSITION                    equ 0000h
RXB0SIDH_SID_SIZE                        equ 0008h
RXB0SIDH_SID_LENGTH                      equ 0008h
RXB0SIDH_SID_MASK                        equ 00FFh
RXB0SIDH_SID3_POSN                       equ 0000h
RXB0SIDH_SID3_POSITION                   equ 0000h
RXB0SIDH_SID3_SIZE                       equ 0001h
RXB0SIDH_SID3_LENGTH                     equ 0001h
RXB0SIDH_SID3_MASK                       equ 0001h
RXB0SIDH_SID4_POSN                       equ 0001h
RXB0SIDH_SID4_POSITION                   equ 0001h
RXB0SIDH_SID4_SIZE                       equ 0001h
RXB0SIDH_SID4_LENGTH                     equ 0001h
RXB0SIDH_SID4_MASK                       equ 0002h
RXB0SIDH_SID5_POSN                       equ 0002h
RXB0SIDH_SID5_POSITION                   equ 0002h
RXB0SIDH_SID5_SIZE                       equ 0001h
RXB0SIDH_SID5_LENGTH                     equ 0001h
RXB0SIDH_SID5_MASK                       equ 0004h
RXB0SIDH_SID6_POSN                       equ 0003h
RXB0SIDH_SID6_POSITION                   equ 0003h
RXB0SIDH_SID6_SIZE                       equ 0001h
RXB0SIDH_SID6_LENGTH                     equ 0001h
RXB0SIDH_SID6_MASK                       equ 0008h
RXB0SIDH_SID7_POSN                       equ 0004h
RXB0SIDH_SID7_POSITION                   equ 0004h
RXB0SIDH_SID7_SIZE                       equ 0001h
RXB0SIDH_SID7_LENGTH                     equ 0001h
RXB0SIDH_SID7_MASK                       equ 0010h
RXB0SIDH_SID8_POSN                       equ 0005h
RXB0SIDH_SID8_POSITION                   equ 0005h
RXB0SIDH_SID8_SIZE                       equ 0001h
RXB0SIDH_SID8_LENGTH                     equ 0001h
RXB0SIDH_SID8_MASK                       equ 0020h
RXB0SIDH_SID9_POSN                       equ 0006h
RXB0SIDH_SID9_POSITION                   equ 0006h
RXB0SIDH_SID9_SIZE                       equ 0001h
RXB0SIDH_SID9_LENGTH                     equ 0001h
RXB0SIDH_SID9_MASK                       equ 0040h
RXB0SIDH_SID10_POSN                      equ 0007h
RXB0SIDH_SID10_POSITION                  equ 0007h
RXB0SIDH_SID10_SIZE                      equ 0001h
RXB0SIDH_SID10_LENGTH                    equ 0001h
RXB0SIDH_SID10_MASK                      equ 0080h
RXB0SIDH_RXB0SID3_POSN                   equ 0000h
RXB0SIDH_RXB0SID3_POSITION               equ 0000h
RXB0SIDH_RXB0SID3_SIZE                   equ 0001h
RXB0SIDH_RXB0SID3_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID3_MASK                   equ 0001h
RXB0SIDH_RXB0SID4_POSN                   equ 0001h
RXB0SIDH_RXB0SID4_POSITION               equ 0001h
RXB0SIDH_RXB0SID4_SIZE                   equ 0001h
RXB0SIDH_RXB0SID4_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID4_MASK                   equ 0002h
RXB0SIDH_RXB0SID5_POSN                   equ 0002h
RXB0SIDH_RXB0SID5_POSITION               equ 0002h
RXB0SIDH_RXB0SID5_SIZE                   equ 0001h
RXB0SIDH_RXB0SID5_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID5_MASK                   equ 0004h
RXB0SIDH_RXB0SID6_POSN                   equ 0003h
RXB0SIDH_RXB0SID6_POSITION               equ 0003h
RXB0SIDH_RXB0SID6_SIZE                   equ 0001h
RXB0SIDH_RXB0SID6_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID6_MASK                   equ 0008h
RXB0SIDH_RXB0SID7_POSN                   equ 0004h
RXB0SIDH_RXB0SID7_POSITION               equ 0004h
RXB0SIDH_RXB0SID7_SIZE                   equ 0001h
RXB0SIDH_RXB0SID7_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID7_MASK                   equ 0010h
RXB0SIDH_RXB0SID8_POSN                   equ 0005h
RXB0SIDH_RXB0SID8_POSITION               equ 0005h
RXB0SIDH_RXB0SID8_SIZE                   equ 0001h
RXB0SIDH_RXB0SID8_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID8_MASK                   equ 0020h
RXB0SIDH_RXB0SID9_POSN                   equ 0006h
RXB0SIDH_RXB0SID9_POSITION               equ 0006h
RXB0SIDH_RXB0SID9_SIZE                   equ 0001h
RXB0SIDH_RXB0SID9_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID9_MASK                   equ 0040h
RXB0SIDH_RXB0SID10_POSN                  equ 0007h
RXB0SIDH_RXB0SID10_POSITION              equ 0007h
RXB0SIDH_RXB0SID10_SIZE                  equ 0001h
RXB0SIDH_RXB0SID10_LENGTH                equ 0001h
RXB0SIDH_RXB0SID10_MASK                  equ 0080h

