GopalSaraf/Practicals/PSDL/include/proc/pic18f25k80.inc
#define FIL14_0                          BANKMASK(MSEL3), 4, b
#define FIL14_1                          BANKMASK(MSEL3), 5, b
#define FIL15_0                          BANKMASK(MSEL3), 6, b
#define FIL15_1                          BANKMASK(MSEL3), 7, b
#define FIL1_0                           BANKMASK(MSEL0), 2, b
#define FIL1_1                           BANKMASK(MSEL0), 3, b
#define FIL2_0                           BANKMASK(MSEL0), 4, b
#define FIL2_1                           BANKMASK(MSEL0), 5, b
#define FIL3_0                           BANKMASK(MSEL0), 6, b
#define FIL3_1                           BANKMASK(MSEL0), 7, b
#define FIL4_0                           BANKMASK(MSEL1), 0, b
#define FIL4_1                           BANKMASK(MSEL1), 1, b
#define FIL5_0                           BANKMASK(MSEL1), 2, b
#define FIL5_1                           BANKMASK(MSEL1), 3, b
#define FIL6_0                           BANKMASK(MSEL1), 4, b
#define FIL6_1                           BANKMASK(MSEL1), 5, b
#define FIL7_0                           BANKMASK(MSEL1), 6, b
#define FIL7_1                           BANKMASK(MSEL1), 7, b
#define FIL8_0                           BANKMASK(MSEL2), 0, b
#define FIL8_1                           BANKMASK(MSEL2), 1, b
#define FIL9_0                           BANKMASK(MSEL2), 2, b
#define FIL9_1                           BANKMASK(MSEL2), 3, b
#define FLC0                             BANKMASK(SDFLC), 0, b
#define FLC1                             BANKMASK(SDFLC), 1, b
#define FLC2                             BANKMASK(SDFLC), 2, b
#define FLC3                             BANKMASK(SDFLC), 3, b
#define FLC4                             BANKMASK(SDFLC), 4, b
#define FREE                             BANKMASK(EECON1), 4, a
#define GCEN                             BANKMASK(SSPCON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HFIOFS                           BANKMASK(OSCCON), 2, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT                          BANKMASK(SSPSTAT), 5, a
#define I2C_READ                         BANKMASK(SSPSTAT), 2, a
#define I2C_START                        BANKMASK(SSPSTAT), 3, a
#define I2C_STOP                         BANKMASK(SSPSTAT), 4, a
#define ICODE20                          BANKMASK(CANSTAT_RO2), 1, b
#define ICODE21                          BANKMASK(CANSTAT_RO2), 2, b
#define IDISSEN                          BANKMASK(CTMUCONH), 1, b
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INT3E                            BANKMASK(INTCON3), 5, a
#define INT3F                            BANKMASK(INTCON3), 2, a
#define INT3IE                           BANKMASK(INTCON3), 5, a
#define INT3IF                           BANKMASK(INTCON3), 2, a
#define INT3IP                           BANKMASK(INTCON2), 1, a
#define INT3P                            BANKMASK(INTCON2), 1, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTEDG3                          BANKMASK(INTCON2), 3, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IOCB4                            BANKMASK(IOCB), 4, b
#define IOCB5                            BANKMASK(IOCB), 5, b
#define IOCB6                            BANKMASK(IOCB), 6, b
#define IOCB7                            BANKMASK(IOCB), 7, b
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRNG0                            BANKMASK(CTMUICON), 0, b
#define IRNG1                            BANKMASK(CTMUICON), 1, b
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define IRXIE                            BANKMASK(PIE5), 7, a
#define IRXIF                            BANKMASK(PIR5), 7, a
#define IRXIP                            BANKMASK(IPR5), 7, a
#define ITRIM0                           BANKMASK(CTMUICON), 2, b
#define ITRIM1                           BANKMASK(CTMUICON), 3, b
#define ITRIM2                           BANKMASK(CTMUICON), 4, b
#define ITRIM3                           BANKMASK(CTMUICON), 5, b
#define ITRIM4                           BANKMASK(CTMUICON), 6, b
#define ITRIM5                           BANKMASK(CTMUICON), 7, b
#define JTOFF                            BANKMASK(RXB0CON), 1, a
#define JTOFF_FILHIT1                    BANKMASK(RXB0CON), 1, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(OSCCON2), 0, a
#define LVDL1                            BANKMASK(OSCCON2), 1, a
#define LVDL2                            BANKMASK(OSCCON2), 2, a
#define LVDL3                            BANKMASK(OSCCON2), 3, a
#define MDSEL0                           BANKMASK(ECANCON), 6, a
#define MDSEL1                           BANKMASK(ECANCON), 7, a
#define MFIOFS                           BANKMASK(OSCCON2), 1, a
#define MFIOSEL                          BANKMASK(OSCCON2), 0, a
#define MSK0                             BANKMASK(SSPADD), 0, a
#define MSK1                             BANKMASK(SSPADD), 1, a
#define MSK2                             BANKMASK(SSPADD), 2, a
#define MSK3                             BANKMASK(SSPADD), 3, a
#define MSK4                             BANKMASK(SSPADD), 4, a
#define MSK5                             BANKMASK(SSPADD), 5, a
#define MSK6                             BANKMASK(SSPADD), 6, a
#define MSK7                             BANKMASK(SSPADD), 7, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSPSTAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSPSTAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_FIFOEMPTY                    BANKMASK(COMSTAT), 7, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RC8                          BANKMASK(RCSTA1), 6, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_TX8                          BANKMASK(TXSTA1), 6, a
#define NOT_W                            BANKMASK(SSPSTAT), 2, a
#define NOT_WRITE                        BANKMASK(SSPSTAT), 2, a
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ANCON0), 0, b
#define PCFG1                            BANKMASK(ANCON0), 1, b
#define PCFG10                           BANKMASK(ANCON1), 2, b
#define PCFG2                            BANKMASK(ANCON0), 2, b
#define PCFG3                            BANKMASK(ANCON0), 3, b
#define PCFG4                            BANKMASK(ANCON0), 4, b
#define PCFG8                            BANKMASK(ANCON1), 0, b
#define PCFG9                            BANKMASK(ANCON1), 1, b
#define PD                               BANKMASK(RCON), 2, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSPCON2), 2, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define PMPTTL                           BANKMASK(PADCFG1), 0, b
#define POR                              BANKMASK(RCON), 1, a
#define PRSEG0                           BANKMASK(BRGCON2), 0, b
#define PRSEG1                           BANKMASK(BRGCON2), 1, b
#define PRSEG2                           BANKMASK(BRGCON2), 2, b
#define PSA                              BANKMASK(T0CON), 3, a
#define PSPMD                            BANKMASK(PMD1), 7, b
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0DBEN                          BANKMASK(RXB0CON), 2, a
#define RB0DBEN_FILHIT2                  BANKMASK(RXB0CON), 2, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC8_92                           BANKMASK(RCSTA2), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, a
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, a
#define RCEN                             BANKMASK(SSPCON2), 3, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RE3                              BANKMASK(PORTE), 3, a
#define READ_WRITE                       BANKMASK(SSPSTAT), 2, a
#define REC0                             BANKMASK(RXERRCNT), 0, b
#define REC1                             BANKMASK(RXERRCNT), 1, b
#define REC2                             BANKMASK(RXERRCNT), 2, b
#define REC3                             BANKMASK(RXERRCNT), 3, b
#define REC4                             BANKMASK(RXERRCNT), 4, b
#define REC5                             BANKMASK(RXERRCNT), 5, b
#define REC6                             BANKMASK(RXERRCNT), 6, b
#define REC7                             BANKMASK(RXERRCNT), 7, b
#define REGSLP                           BANKMASK(WDTCON), 7, a
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RODIV0                           BANKMASK(REFOCON), 0, a
#define RODIV1                           BANKMASK(REFOCON), 1, a
#define RODIV2                           BANKMASK(REFOCON), 2, a
#define RODIV3                           BANKMASK(REFOCON), 3, a
#define ROON                             BANKMASK(REFOCON), 7, a
#define ROSEL                            BANKMASK(REFOCON), 4, a
#define ROSSLP                           BANKMASK(REFOCON), 5, a
#define RSEN                             BANKMASK(SSPCON2), 1, a
#define RW                               BANKMASK(SSPSTAT), 2, a
#define RX91                             BANKMASK(RCSTA1), 6, a
#define RX92                             BANKMASK(RCSTA2), 6, a
#define RX9D1                            BANKMASK(RCSTA1), 0, a
#define RX9D2                            BANKMASK(RCSTA2), 0, a
#define RXB0D00                          BANKMASK(RXB0D0), 0, a
#define RXB0D01                          BANKMASK(RXB0D0), 1, a
#define RXB0D02                          BANKMASK(RXB0D0), 2, a
#define RXB0D03                          BANKMASK(RXB0D0), 3, a
#define RXB0D04                          BANKMASK(RXB0D0), 4, a
#define RXB0D05                          BANKMASK(RXB0D0), 5, a
#define RXB0D06                          BANKMASK(RXB0D0), 6, a
#define RXB0D07                          BANKMASK(RXB0D0), 7, a
#define RXB0D10                          BANKMASK(RXB0D1), 0, a
#define RXB0D11                          BANKMASK(RXB0D1), 1, a
#define RXB0D12                          BANKMASK(RXB0D1), 2, a
#define RXB0D13                          BANKMASK(RXB0D1), 3, a
#define RXB0D14                          BANKMASK(RXB0D1), 4, a
#define RXB0D15                          BANKMASK(RXB0D1), 5, a
#define RXB0D16                          BANKMASK(RXB0D1), 6, a
#define RXB0D17                          BANKMASK(RXB0D1), 7, a
#define RXB0D20                          BANKMASK(RXB0D2), 0, a
#define RXB0D21                          BANKMASK(RXB0D2), 1, a
#define RXB0D22                          BANKMASK(RXB0D2), 2, a
#define RXB0D23                          BANKMASK(RXB0D2), 3, a
#define RXB0D24                          BANKMASK(RXB0D2), 4, a
#define RXB0D25                          BANKMASK(RXB0D2), 5, a
#define RXB0D26                          BANKMASK(RXB0D2), 6, a
#define RXB0D27                          BANKMASK(RXB0D2), 7, a
#define RXB0D30                          BANKMASK(RXB0D3), 0, a
#define RXB0D31                          BANKMASK(RXB0D3), 1, a
#define RXB0D32                          BANKMASK(RXB0D3), 2, a
#define RXB0D33                          BANKMASK(RXB0D3), 3, a
#define RXB0D34                          BANKMASK(RXB0D3), 4, a
#define RXB0D35                          BANKMASK(RXB0D3), 5, a
#define RXB0D36                          BANKMASK(RXB0D3), 6, a
#define RXB0D37                          BANKMASK(RXB0D3), 7, a
#define RXB0D40                          BANKMASK(RXB0D4), 0, a
#define RXB0D41                          BANKMASK(RXB0D4), 1, a
#define RXB0D42                          BANKMASK(RXB0D4), 2, a
#define RXB0D43                          BANKMASK(RXB0D4), 3, a
#define RXB0D44                          BANKMASK(RXB0D4), 4, a
#define RXB0D45                          BANKMASK(RXB0D4), 5, a
#define RXB0D46                          BANKMASK(RXB0D4), 6, a
#define RXB0D47                          BANKMASK(RXB0D4), 7, a
#define RXB0D50                          BANKMASK(RXB0D5), 0, a
#define RXB0D51                          BANKMASK(RXB0D5), 1, a
#define RXB0D52                          BANKMASK(RXB0D5), 2, a
#define RXB0D53                          BANKMASK(RXB0D5), 3, a
#define RXB0D54                          BANKMASK(RXB0D5), 4, a
#define RXB0D55                          BANKMASK(RXB0D5), 5, a
#define RXB0D56                          BANKMASK(RXB0D5), 6, a
#define RXB0D57                          BANKMASK(RXB0D5), 7, a
#define RXB0D60                          BANKMASK(RXB0D6), 0, a
#define RXB0D61                          BANKMASK(RXB0D6), 1, a
#define RXB0D62                          BANKMASK(RXB0D6), 2, a
#define RXB0D63                          BANKMASK(RXB0D6), 3, a
#define RXB0D64                          BANKMASK(RXB0D6), 4, a
#define RXB0D65                          BANKMASK(RXB0D6), 5, a
#define RXB0D66                          BANKMASK(RXB0D6), 6, a
#define RXB0D67                          BANKMASK(RXB0D6), 7, a
#define RXB0D70                          BANKMASK(RXB0D7), 0, a
#define RXB0D71                          BANKMASK(RXB0D7), 1, a
#define RXB0D72                          BANKMASK(RXB0D7), 2, a
#define RXB0D73                          BANKMASK(RXB0D7), 3, a
#define RXB0D74                          BANKMASK(RXB0D7), 4, a
#define RXB0D75                          BANKMASK(RXB0D7), 5, a
#define RXB0D76                          BANKMASK(RXB0D7), 6, a
#define RXB0D77                          BANKMASK(RXB0D7), 7, a
#define RXB0DLC0                         BANKMASK(RXB0DLC), 0, a
#define RXB0DLC1                         BANKMASK(RXB0DLC), 1, a
