GopalSaraf/Practicals/PSDL/include/proc/pic18f25k80.inc
#define RXB0DLC2                         BANKMASK(RXB0DLC), 2, a
#define RXB0DLC3                         BANKMASK(RXB0DLC), 3, a
#define RXB0EID0                         BANKMASK(RXB0EIDL), 0, a
#define RXB0EID1                         BANKMASK(RXB0EIDL), 1, a
#define RXB0EID10                        BANKMASK(RXB0EIDH), 2, a
#define RXB0EID11                        BANKMASK(RXB0EIDH), 3, a
#define RXB0EID12                        BANKMASK(RXB0EIDH), 4, a
#define RXB0EID13                        BANKMASK(RXB0EIDH), 5, a
#define RXB0EID14                        BANKMASK(RXB0EIDH), 6, a
#define RXB0EID15                        BANKMASK(RXB0EIDH), 7, a
#define RXB0EID16                        BANKMASK(RXB0SIDL), 0, a
#define RXB0EID17                        BANKMASK(RXB0SIDL), 1, a
#define RXB0EID2                         BANKMASK(RXB0EIDL), 2, a
#define RXB0EID3                         BANKMASK(RXB0EIDL), 3, a
#define RXB0EID4                         BANKMASK(RXB0EIDL), 4, a
#define RXB0EID5                         BANKMASK(RXB0EIDL), 5, a
#define RXB0EID6                         BANKMASK(RXB0EIDL), 6, a
#define RXB0EID7                         BANKMASK(RXB0EIDL), 7, a
#define RXB0EID8                         BANKMASK(RXB0EIDH), 0, a
#define RXB0EID9                         BANKMASK(RXB0EIDH), 1, a
#define RXB0EXID                         BANKMASK(RXB0SIDL), 3, a
#define RXB0FILHIT0                      BANKMASK(RXB0CON), 0, a
#define RXB0FILHIT1                      BANKMASK(RXB0CON), 1, a
#define RXB0FILHIT2                      BANKMASK(RXB0CON), 2, a
#define RXB0FILHIT3                      BANKMASK(RXB0CON), 3, a
#define RXB0FILHIT4                      BANKMASK(RXB0CON), 4, a
#define RXB0FUL                          BANKMASK(RXB0CON), 7, a
#define RXB0IF                           BANKMASK(PIR5), 0, a
#define RXB0IP                           BANKMASK(IPR5), 0, a
#define RXB0M0                           BANKMASK(RXB0CON), 5, a
#define RXB0M1                           BANKMASK(RXB0CON), 6, a
#define RXB0OVFL                         BANKMASK(COMSTAT), 7, a
#define RXB0RB0                          BANKMASK(RXB0DLC), 4, a
#define RXB0RB1                          BANKMASK(RXB0DLC), 5, a
#define RXB0RTR                          BANKMASK(RXB0DLC), 6, a
#define RXB0RTRR0                        BANKMASK(RXB0CON), 3, a
#define RXB0RTRRO                        BANKMASK(RXB0CON), 5, a
#define RXB0SID0                         BANKMASK(RXB0SIDL), 5, a
#define RXB0SID1                         BANKMASK(RXB0SIDL), 6, a
#define RXB0SID10                        BANKMASK(RXB0SIDH), 7, a
#define RXB0SID2                         BANKMASK(RXB0SIDL), 7, a
#define RXB0SID3                         BANKMASK(RXB0SIDH), 0, a
#define RXB0SID4                         BANKMASK(RXB0SIDH), 1, a
#define RXB0SID5                         BANKMASK(RXB0SIDH), 2, a
#define RXB0SID6                         BANKMASK(RXB0SIDH), 3, a
#define RXB0SID7                         BANKMASK(RXB0SIDH), 4, a
#define RXB0SID8                         BANKMASK(RXB0SIDH), 5, a
#define RXB0SID9                         BANKMASK(RXB0SIDH), 6, a
#define RXB0SRR                          BANKMASK(RXB0SIDL), 4, a
#define RXB1D00                          BANKMASK(RXB1D0), 0, b
#define RXB1D01                          BANKMASK(RXB1D0), 1, b
#define RXB1D02                          BANKMASK(RXB1D0), 2, b
#define RXB1D03                          BANKMASK(RXB1D0), 3, b
#define RXB1D04                          BANKMASK(RXB1D0), 4, b
#define RXB1D05                          BANKMASK(RXB1D0), 5, b
#define RXB1D06                          BANKMASK(RXB1D0), 6, b
#define RXB1D07                          BANKMASK(RXB1D0), 7, b
#define RXB1D10                          BANKMASK(RXB1D1), 0, b
#define RXB1D11                          BANKMASK(RXB1D1), 1, b
#define RXB1D12                          BANKMASK(RXB1D1), 2, b
#define RXB1D13                          BANKMASK(RXB1D1), 3, b
#define RXB1D14                          BANKMASK(RXB1D1), 4, b
#define RXB1D15                          BANKMASK(RXB1D1), 5, b
#define RXB1D16                          BANKMASK(RXB1D1), 6, b
#define RXB1D17                          BANKMASK(RXB1D1), 7, b
#define RXB1D20                          BANKMASK(RXB1D2), 0, b
#define RXB1D21                          BANKMASK(RXB1D2), 1, b
#define RXB1D22                          BANKMASK(RXB1D2), 2, b
#define RXB1D23                          BANKMASK(RXB1D2), 3, b
#define RXB1D24                          BANKMASK(RXB1D2), 4, b
#define RXB1D25                          BANKMASK(RXB1D2), 5, b
#define RXB1D26                          BANKMASK(RXB1D2), 6, b
#define RXB1D27                          BANKMASK(RXB1D2), 7, b
#define RXB1D30                          BANKMASK(RXB1D3), 0, b
#define RXB1D31                          BANKMASK(RXB1D3), 1, b
#define RXB1D32                          BANKMASK(RXB1D3), 2, b
#define RXB1D33                          BANKMASK(RXB1D3), 3, b
#define RXB1D34                          BANKMASK(RXB1D3), 4, b
#define RXB1D35                          BANKMASK(RXB1D3), 5, b
#define RXB1D36                          BANKMASK(RXB1D3), 6, b
#define RXB1D37                          BANKMASK(RXB1D3), 7, b
#define RXB1D40                          BANKMASK(RXB1D4), 0, b
#define RXB1D41                          BANKMASK(RXB1D4), 1, b
#define RXB1D42                          BANKMASK(RXB1D4), 2, b
#define RXB1D43                          BANKMASK(RXB1D4), 3, b
#define RXB1D44                          BANKMASK(RXB1D4), 4, b
#define RXB1D45                          BANKMASK(RXB1D4), 5, b
#define RXB1D46                          BANKMASK(RXB1D4), 6, b
#define RXB1D47                          BANKMASK(RXB1D4), 7, b
#define RXB1D50                          BANKMASK(RXB1D5), 0, b
#define RXB1D51                          BANKMASK(RXB1D5), 1, b
#define RXB1D52                          BANKMASK(RXB1D5), 2, b
#define RXB1D53                          BANKMASK(RXB1D5), 3, b
#define RXB1D54                          BANKMASK(RXB1D5), 4, b
#define RXB1D55                          BANKMASK(RXB1D5), 5, b
#define RXB1D56                          BANKMASK(RXB1D5), 6, b
#define RXB1D57                          BANKMASK(RXB1D5), 7, b
#define RXB1D60                          BANKMASK(RXB1D6), 0, b
#define RXB1D61                          BANKMASK(RXB1D6), 1, b
#define RXB1D62                          BANKMASK(RXB1D6), 2, b
#define RXB1D63                          BANKMASK(RXB1D6), 3, b
#define RXB1D64                          BANKMASK(RXB1D6), 4, b
#define RXB1D65                          BANKMASK(RXB1D6), 5, b
#define RXB1D66                          BANKMASK(RXB1D6), 6, b
#define RXB1D67                          BANKMASK(RXB1D6), 7, b
#define RXB1D70                          BANKMASK(RXB1D7), 0, b
#define RXB1D71                          BANKMASK(RXB1D7), 1, b
#define RXB1D72                          BANKMASK(RXB1D7), 2, b
#define RXB1D73                          BANKMASK(RXB1D7), 3, b
#define RXB1D74                          BANKMASK(RXB1D7), 4, b
#define RXB1D75                          BANKMASK(RXB1D7), 5, b
#define RXB1D76                          BANKMASK(RXB1D7), 6, b
#define RXB1D77                          BANKMASK(RXB1D7), 7, b
#define RXB1DLC0                         BANKMASK(RXB1DLC), 0, b
#define RXB1DLC1                         BANKMASK(RXB1DLC), 1, b
#define RXB1DLC2                         BANKMASK(RXB1DLC), 2, b
#define RXB1DLC3                         BANKMASK(RXB1DLC), 3, b
#define RXB1EID0                         BANKMASK(RXB1EIDL), 0, b
#define RXB1EID1                         BANKMASK(RXB1EIDL), 1, b
#define RXB1EID10                        BANKMASK(RXB1EIDH), 2, b
#define RXB1EID11                        BANKMASK(RXB1EIDH), 3, b
#define RXB1EID12                        BANKMASK(RXB1EIDH), 4, b
#define RXB1EID13                        BANKMASK(RXB1EIDH), 5, b
#define RXB1EID14                        BANKMASK(RXB1EIDH), 6, b
#define RXB1EID15                        BANKMASK(RXB1EIDH), 7, b
#define RXB1EID16                        BANKMASK(RXB1SIDL), 0, b
#define RXB1EID17                        BANKMASK(RXB1SIDL), 1, b
#define RXB1EID2                         BANKMASK(RXB1EIDL), 2, b
#define RXB1EID3                         BANKMASK(RXB1EIDL), 3, b
#define RXB1EID4                         BANKMASK(RXB1EIDL), 4, b
#define RXB1EID5                         BANKMASK(RXB1EIDL), 5, b
#define RXB1EID6                         BANKMASK(RXB1EIDL), 6, b
#define RXB1EID7                         BANKMASK(RXB1EIDL), 7, b
#define RXB1EID8                         BANKMASK(RXB1EIDH), 0, b
#define RXB1EID9                         BANKMASK(RXB1EIDH), 1, b
#define RXB1EXID                         BANKMASK(RXB1SIDL), 3, b
#define RXB1FILHIT0                      BANKMASK(RXB1CON), 0, b
#define RXB1FILHIT1                      BANKMASK(RXB1CON), 1, b
#define RXB1FILHIT2                      BANKMASK(RXB1CON), 2, b
#define RXB1FILHIT3                      BANKMASK(RXB1CON), 3, b
#define RXB1FILHIT4                      BANKMASK(RXB1CON), 4, b
#define RXB1FUL                          BANKMASK(RXB1CON), 7, b
#define RXB1IF                           BANKMASK(PIR5), 1, a
#define RXB1IP                           BANKMASK(IPR5), 1, a
#define RXB1M0                           BANKMASK(RXB1CON), 5, b
#define RXB1M1                           BANKMASK(RXB1CON), 6, b
#define RXB1OVFL                         BANKMASK(COMSTAT), 6, a
#define RXB1RB0                          BANKMASK(RXB1DLC), 4, b
#define RXB1RB1                          BANKMASK(RXB1DLC), 5, b
#define RXB1RTR                          BANKMASK(RXB1DLC), 6, b
#define RXB1RTRR0                        BANKMASK(RXB1CON), 3, b
#define RXB1RTRRO                        BANKMASK(RXB1CON), 5, b
#define RXB1SID0                         BANKMASK(RXB1SIDL), 5, b
#define RXB1SID1                         BANKMASK(RXB1SIDL), 6, b
#define RXB1SID10                        BANKMASK(RXB1SIDH), 7, b
#define RXB1SID2                         BANKMASK(RXB1SIDL), 7, b
#define RXB1SID3                         BANKMASK(RXB1SIDH), 0, b
#define RXB1SID4                         BANKMASK(RXB1SIDH), 1, b
#define RXB1SID5                         BANKMASK(RXB1SIDH), 2, b
#define RXB1SID6                         BANKMASK(RXB1SIDH), 3, b
#define RXB1SID7                         BANKMASK(RXB1SIDH), 4, b
#define RXB1SID8                         BANKMASK(RXB1SIDH), 5, b
#define RXB1SID9                         BANKMASK(RXB1SIDH), 6, b
#define RXB1SRR                          BANKMASK(RXB1SIDL), 4, b
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXBNOVFL                         BANKMASK(COMSTAT), 6, a
#define RXBP                             BANKMASK(COMSTAT), 3, a
#define RXBnIE                           BANKMASK(PIE5), 1, a
#define RXBnIF                           BANKMASK(PIR5), 1, a
#define RXBnIP                           BANKMASK(IPR5), 1, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define RXDTP2                           BANKMASK(BAUDCON2), 5, a
#define RXF0EID0                         BANKMASK(RXF0EIDL), 0, b
#define RXF0EID1                         BANKMASK(RXF0EIDL), 1, b
#define RXF0EID10                        BANKMASK(RXF0EIDH), 2, b
#define RXF0EID11                        BANKMASK(RXF0EIDH), 3, b
#define RXF0EID12                        BANKMASK(RXF0EIDH), 4, b
#define RXF0EID13                        BANKMASK(RXF0EIDH), 5, b
#define RXF0EID14                        BANKMASK(RXF0EIDH), 6, b
#define RXF0EID15                        BANKMASK(RXF0EIDH), 7, b
#define RXF0EID16                        BANKMASK(RXF0SIDL), 0, b
#define RXF0EID17                        BANKMASK(RXF0SIDL), 1, b
#define RXF0EID2                         BANKMASK(RXF0EIDL), 2, b
#define RXF0EID3                         BANKMASK(RXF0EIDL), 3, b
#define RXF0EID4                         BANKMASK(RXF0EIDL), 4, b
#define RXF0EID5                         BANKMASK(RXF0EIDL), 5, b
#define RXF0EID6                         BANKMASK(RXF0EIDL), 6, b
#define RXF0EID7                         BANKMASK(RXF0EIDL), 7, b
#define RXF0EID8                         BANKMASK(RXF0EIDH), 0, b
#define RXF0EID9                         BANKMASK(RXF0EIDH), 1, b
#define RXF0EN                           BANKMASK(RXFCON0), 0, b
#define RXF0EXIDEN                       BANKMASK(RXF0SIDL), 3, b
#define RXF0SID0                         BANKMASK(RXF0SIDL), 5, b
#define RXF0SID1                         BANKMASK(RXF0SIDL), 6, b
#define RXF0SID10                        BANKMASK(RXF0SIDH), 7, b
#define RXF0SID2                         BANKMASK(RXF0SIDL), 7, b
#define RXF0SID3                         BANKMASK(RXF0SIDH), 0, b
#define RXF0SID4                         BANKMASK(RXF0SIDH), 1, b
#define RXF0SID5                         BANKMASK(RXF0SIDH), 2, b
#define RXF0SID6                         BANKMASK(RXF0SIDH), 3, b
#define RXF0SID7                         BANKMASK(RXF0SIDH), 4, b
#define RXF0SID8                         BANKMASK(RXF0SIDH), 5, b
#define RXF0SID9                         BANKMASK(RXF0SIDH), 6, b
#define RXF10EID0                        BANKMASK(RXF10EIDL), 0, b
#define RXF10EID1                        BANKMASK(RXF10EIDL), 1, b
#define RXF10EID10                       BANKMASK(RXF10EIDH), 2, b
#define RXF10EID11                       BANKMASK(RXF10EIDH), 3, b
#define RXF10EID12                       BANKMASK(RXF10EIDH), 4, b
#define RXF10EID13                       BANKMASK(RXF10EIDH), 5, b
#define RXF10EID14                       BANKMASK(RXF10EIDH), 6, b
#define RXF10EID15                       BANKMASK(RXF10EIDH), 7, b
#define RXF10EID16                       BANKMASK(RXF10SIDL), 0, b
#define RXF10EID17                       BANKMASK(RXF10SIDL), 1, b
#define RXF10EID2                        BANKMASK(RXF10EIDL), 2, b
#define RXF10EID3                        BANKMASK(RXF10EIDL), 3, b
#define RXF10EID4                        BANKMASK(RXF10EIDL), 4, b
#define RXF10EID5                        BANKMASK(RXF10EIDL), 5, b
#define RXF10EID6                        BANKMASK(RXF10EIDL), 6, b
#define RXF10EID7                        BANKMASK(RXF10EIDL), 7, b
#define RXF10EID8                        BANKMASK(RXF10EIDH), 0, b
#define RXF10EID9                        BANKMASK(RXF10EIDH), 1, b
#define RXF10EN                          BANKMASK(RXFCON1), 2, b
#define RXF10EXIDEN                      BANKMASK(RXF10SIDL), 3, b
#define RXF10SID0                        BANKMASK(RXF10SIDL), 5, b
#define RXF10SID1                        BANKMASK(RXF10SIDL), 6, b
#define RXF10SID10                       BANKMASK(RXF10SIDH), 7, b
#define RXF10SID2                        BANKMASK(RXF10SIDL), 7, b
#define RXF10SID3                        BANKMASK(RXF10SIDH), 0, b
#define RXF10SID4                        BANKMASK(RXF10SIDH), 1, b
#define RXF10SID5                        BANKMASK(RXF10SIDH), 2, b
#define RXF10SID6                        BANKMASK(RXF10SIDH), 3, b
#define RXF10SID7                        BANKMASK(RXF10SIDH), 4, b
#define RXF10SID8                        BANKMASK(RXF10SIDH), 5, b
#define RXF10SID9                        BANKMASK(RXF10SIDH), 6, b
#define RXF11EID0                        BANKMASK(RXF11EIDL), 0, b
#define RXF11EID1                        BANKMASK(RXF11EIDL), 1, b
#define RXF11EID10                       BANKMASK(RXF11EIDH), 2, b
#define RXF11EID11                       BANKMASK(RXF11EIDH), 3, b
#define RXF11EID12                       BANKMASK(RXF11EIDH), 4, b
#define RXF11EID13                       BANKMASK(RXF11EIDH), 5, b
#define RXF11EID14                       BANKMASK(RXF11EIDH), 6, b
#define RXF11EID15                       BANKMASK(RXF11EIDH), 7, b
#define RXF11EID16                       BANKMASK(RXF11SIDL), 0, b
#define RXF11EID17                       BANKMASK(RXF11SIDL), 1, b
#define RXF11EID2                        BANKMASK(RXF11EIDL), 2, b
#define RXF11EID3                        BANKMASK(RXF11EIDL), 3, b
#define RXF11EID4                        BANKMASK(RXF11EIDL), 4, b
#define RXF11EID5                        BANKMASK(RXF11EIDL), 5, b
#define RXF11EID6                        BANKMASK(RXF11EIDL), 6, b
#define RXF11EID7                        BANKMASK(RXF11EIDL), 7, b
#define RXF11EID8                        BANKMASK(RXF11EIDH), 0, b
#define RXF11EID9                        BANKMASK(RXF11EIDH), 1, b
#define RXF11EN                          BANKMASK(RXFCON1), 3, b
#define RXF11EXIDEN                      BANKMASK(RXF11SIDL), 3, b
#define RXF11SID0                        BANKMASK(RXF11SIDL), 5, b
#define RXF11SID1                        BANKMASK(RXF11SIDL), 6, b
#define RXF11SID10                       BANKMASK(RXF11SIDH), 7, b
#define RXF11SID2                        BANKMASK(RXF11SIDL), 7, b
#define RXF11SID3                        BANKMASK(RXF11SIDH), 0, b
#define RXF11SID4                        BANKMASK(RXF11SIDH), 1, b
#define RXF11SID5                        BANKMASK(RXF11SIDH), 2, b
#define RXF11SID6                        BANKMASK(RXF11SIDH), 3, b
#define RXF11SID7                        BANKMASK(RXF11SIDH), 4, b
#define RXF11SID8                        BANKMASK(RXF11SIDH), 5, b
#define RXF11SID9                        BANKMASK(RXF11SIDH), 6, b
#define RXF12EID0                        BANKMASK(RXF12EIDL), 0, b
#define RXF12EID1                        BANKMASK(RXF12EIDL), 1, b
#define RXF12EID10                       BANKMASK(RXF12EIDH), 2, b
#define RXF12EID11                       BANKMASK(RXF12EIDH), 3, b
#define RXF12EID12                       BANKMASK(RXF12EIDH), 4, b
#define RXF12EID13                       BANKMASK(RXF12EIDH), 5, b
#define RXF12EID14                       BANKMASK(RXF12EIDH), 6, b
#define RXF12EID15                       BANKMASK(RXF12EIDH), 7, b
#define RXF12EID16                       BANKMASK(RXF12SIDL), 0, b
#define RXF12EID17                       BANKMASK(RXF12SIDL), 1, b
#define RXF12EID2                        BANKMASK(RXF12EIDL), 2, b
#define RXF12EID3                        BANKMASK(RXF12EIDL), 3, b
#define RXF12EID4                        BANKMASK(RXF12EIDL), 4, b
#define RXF12EID5                        BANKMASK(RXF12EIDL), 5, b
#define RXF12EID6                        BANKMASK(RXF12EIDL), 6, b
#define RXF12EID7                        BANKMASK(RXF12EIDL), 7, b
#define RXF12EID8                        BANKMASK(RXF12EIDH), 0, b
#define RXF12EID9                        BANKMASK(RXF12EIDH), 1, b
#define RXF12EN                          BANKMASK(RXFCON1), 4, b
#define RXF12EXIDEN                      BANKMASK(RXF12SIDL), 3, b
#define RXF12SID0                        BANKMASK(RXF12SIDL), 5, b
#define RXF12SID1                        BANKMASK(RXF12SIDL), 6, b
#define RXF12SID10                       BANKMASK(RXF12SIDH), 7, b
#define RXF12SID2                        BANKMASK(RXF12SIDL), 7, b
#define RXF12SID3                        BANKMASK(RXF12SIDH), 0, b
#define RXF12SID4                        BANKMASK(RXF12SIDH), 1, b
#define RXF12SID5                        BANKMASK(RXF12SIDH), 2, b
#define RXF12SID6                        BANKMASK(RXF12SIDH), 3, b
#define RXF12SID7                        BANKMASK(RXF12SIDH), 4, b
#define RXF12SID8                        BANKMASK(RXF12SIDH), 5, b
#define RXF12SID9                        BANKMASK(RXF12SIDH), 6, b
#define RXF13EID0                        BANKMASK(RXF13EIDL), 0, b
#define RXF13EID1                        BANKMASK(RXF13EIDL), 1, b
#define RXF13EID10                       BANKMASK(RXF13EIDH), 2, b
#define RXF13EID11                       BANKMASK(RXF13EIDH), 3, b
#define RXF13EID12                       BANKMASK(RXF13EIDH), 4, b
#define RXF13EID13                       BANKMASK(RXF13EIDH), 5, b
#define RXF13EID14                       BANKMASK(RXF13EIDH), 6, b
#define RXF13EID15                       BANKMASK(RXF13EIDH), 7, b
#define RXF13EID16                       BANKMASK(RXF13SIDL), 0, b
#define RXF13EID17                       BANKMASK(RXF13SIDL), 1, b
#define RXF13EID2                        BANKMASK(RXF13EIDL), 2, b
#define RXF13EID3                        BANKMASK(RXF13EIDL), 3, b
#define RXF13EID4                        BANKMASK(RXF13EIDL), 4, b
#define RXF13EID5                        BANKMASK(RXF13EIDL), 5, b
#define RXF13EID6                        BANKMASK(RXF13EIDL), 6, b
#define RXF13EID7                        BANKMASK(RXF13EIDL), 7, b
#define RXF13EID8                        BANKMASK(RXF13EIDH), 0, b
#define RXF13EID9                        BANKMASK(RXF13EIDH), 1, b
#define RXF13EN                          BANKMASK(RXFCON1), 5, b
#define RXF13EXIDEN                      BANKMASK(RXF13SIDL), 3, b
#define RXF13SID0                        BANKMASK(RXF13SIDL), 5, b
#define RXF13SID1                        BANKMASK(RXF13SIDL), 6, b
#define RXF13SID10                       BANKMASK(RXF13SIDH), 7, b
#define RXF13SID2                        BANKMASK(RXF13SIDL), 7, b
#define RXF13SID3                        BANKMASK(RXF13SIDH), 0, b
#define RXF13SID4                        BANKMASK(RXF13SIDH), 1, b
#define RXF13SID5                        BANKMASK(RXF13SIDH), 2, b
#define RXF13SID6                        BANKMASK(RXF13SIDH), 3, b
#define RXF13SID7                        BANKMASK(RXF13SIDH), 4, b
#define RXF13SID8                        BANKMASK(RXF13SIDH), 5, b
#define RXF13SID9                        BANKMASK(RXF13SIDH), 6, b
#define RXF14EID0                        BANKMASK(RXF14EIDL), 0, b
#define RXF14EID1                        BANKMASK(RXF14EIDL), 1, b
#define RXF14EID10                       BANKMASK(RXF14EIDH), 2, b
#define RXF14EID11                       BANKMASK(RXF14EIDH), 3, b
#define RXF14EID12                       BANKMASK(RXF14EIDH), 4, b
#define RXF14EID13                       BANKMASK(RXF14EIDH), 5, b
#define RXF14EID14                       BANKMASK(RXF14EIDH), 6, b
#define RXF14EID15                       BANKMASK(RXF14EIDH), 7, b
#define RXF14EID16                       BANKMASK(RXF14SIDL), 0, b
#define RXF14EID17                       BANKMASK(RXF14SIDL), 1, b
#define RXF14EID2                        BANKMASK(RXF14EIDL), 2, b
#define RXF14EID3                        BANKMASK(RXF14EIDL), 3, b
#define RXF14EID4                        BANKMASK(RXF14EIDL), 4, b
#define RXF14EID5                        BANKMASK(RXF14EIDL), 5, b
#define RXF14EID6                        BANKMASK(RXF14EIDL), 6, b
#define RXF14EID7                        BANKMASK(RXF14EIDL), 7, b
#define RXF14EID8                        BANKMASK(RXF14EIDH), 0, b
#define RXF14EID9                        BANKMASK(RXF14EIDH), 1, b
#define RXF14EN                          BANKMASK(RXFCON1), 6, b
#define RXF14EXIDEN                      BANKMASK(RXF14SIDL), 3, b
#define RXF14SID0                        BANKMASK(RXF14SIDL), 5, b
#define RXF14SID1                        BANKMASK(RXF14SIDL), 6, b
#define RXF14SID10                       BANKMASK(RXF14SIDH), 7, b
#define RXF14SID2                        BANKMASK(RXF14SIDL), 7, b
#define RXF14SID3                        BANKMASK(RXF14SIDH), 0, b
#define RXF14SID4                        BANKMASK(RXF14SIDH), 1, b
#define RXF14SID5                        BANKMASK(RXF14SIDH), 2, b
#define RXF14SID6                        BANKMASK(RXF14SIDH), 3, b
#define RXF14SID7                        BANKMASK(RXF14SIDH), 4, b
#define RXF14SID8                        BANKMASK(RXF14SIDH), 5, b
#define RXF14SID9                        BANKMASK(RXF14SIDH), 6, b
#define RXF15EID0                        BANKMASK(RXF15EIDL), 0, b
#define RXF15EID1                        BANKMASK(RXF15EIDL), 1, b
#define RXF15EID10                       BANKMASK(RXF15EIDH), 2, b
#define RXF15EID11                       BANKMASK(RXF15EIDH), 3, b
